# 参考：http://m.sh.bendibao.com/news/206392.html
import torch
from PIL import Image
import numpy as np

import cn_clip.clip as clip
from cn_clip.clip import load_from_name, available_models

recyclable = ['纸张', '纸板箱', '报纸', '废弃书本', '快递纸袋', '打印纸', '信封', '广告单', '纸塑铝复合包装',
             '塑料', '塑料瓶', '瓶盖', '食用油桶', '塑料碗', '塑料盒子', '塑料玩具', '塑料衣架', '施工安全帽',
             '玻璃制品', '食品及日用品玻璃瓶罐', '玻璃杯', '窗玻璃', '玻璃制品',
             '金属', '金属瓶罐', '金属厨具', '金属工具', '金属制品',
             '织物', '旧衣服', '床单', '枕头', '棉被', '皮鞋', '毛绒玩具', '棉袄', '包', '皮带', '丝绸制品',
             '电路板', '充电宝', '电线', '插头', '木制品']

hazardous = ['电池', '药品', '药品包装物', '油漆', '油漆包装物', '溶剂', '溶剂包装物',
            '矿物油', '矿物油包装物', '含汞温度计', '含汞血压计', '杀虫剂', '杀虫剂包装', '胶片', '相纸']

wet = ['食品','食品废渣', '谷物及其加工食品', '肉蛋及其加工食品', '水产及其加工食品', '蔬菜', '调料', '酱料', '剩菜剩饭', '过期食品', '瓜皮果核', '花卉植物', '中药药渣']

dry = ['餐巾纸', '卫生间用纸', '尿不湿', '猫砂', '狗尿垫', '污损纸张', '烟蒂', '干燥剂', '污损塑料', '尼龙制品', '编织袋', '防碎气泡膜',
      '大骨头', '硬贝壳', '硬果壳', '硬果实', '毛发', '灰土', '炉渣', '橡皮泥', '太空沙', '带胶制品', '花盆', '毛巾',
      '一次性餐具', '镜子', '陶瓷制品', '竹制品', '竹篮', '竹筷' ,'牙签', '伞', '笔', '眼镜', '打火机']

others = ['吃剩的外卖', '手机']

others_dict = {'吃剩的外卖': '外卖包装属于干垃圾，食物残渣属于湿垃圾', '手机': '处理较为复杂，建议交给专业处理机构进行处理'}

combined = recyclable + hazardous + wet + dry + others
